IDENTIFICATION DIVISION.
PROGRAM-ID. CalculatorTest.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 TEST-NUMBER.
01 NUM2 TEST-NUMBER.
01 EXPECTED-RESULT TEST-NUMBER.

PROCEDURE DIVISION.

    MOVE 5 TO NUM1.
    MOVE 7 TO NUM2.
    MOVE 12 TO EXPECTED-RESULT.

    CALL "Calculator" USING NUM1 NUM2.

    IF RESULT = EXPECTED-RESULT
        DISPLAY "Test Passed"
    ELSE
        DISPLAY "Test Failed".

    STOP RUN.

